{
  "_name_or_path": "./gdrive/MyDrive/gov_clf_ner",
  "architectures": [
    "ClassifierNER"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "clf_labels": {
    "0": "Negative",
    "1": "Governing Law"
  },
  "eos_token_ids": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "ner_labels": {
    "0": "B-gov_law",
    "1": "I-gov_law",
    "2": "O"
  },
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": null,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer": "sguarnaccio/gov_law_clf",
  "torch_dtype": "float32",
  "transformers_version": "4.27.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
